# How does the syntax of a CREATE VIEW statement look?

* CREATE VIEW view_name AS
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition;

# How does the syntax of a REPLACE VIEW statement look?

* CREATE OR REPLACE VIEW view_name AS
* SELECT column1, column2, ...
* FROM table_name
* WHERE condition;

# How does the syntax of a DROP VIEW statement look?

DROP VIEW view_name;

In [1]:
# Importning Liabraries
import mysql.connector
from mysql.connector import Error
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Making connection to the MySql Database
conn = mysql.connector.connect(host='localhost',
                               password='Tanmay@2002',
                               user='root',
                               database='sakila')
# Checking the conection try and except block
try:
    if conn.is_connected():
        db_info=conn.get_server_info()
        print("Successfully connected to MySQL Database with server",db_info)
except Error as e:
    print('Unable to connect to the database ):')

Successfully connected to MySQL Database with server 8.0.26

In [3]:
#Making Cursor Object
cursor = conn.cursor()

In [4]:
df = pd.read_sql('select * from actor;',conn)
df.head(5)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

### Exercise 1: Create a View

In [11]:
#cursor.execute("""create view actorinfo as
                    select first_name,last_name
                    from actor;
                    """)

IndentationError: unexpected indent (<ipython-input-11-137c5dccb0ba>, line 2)

In [7]:
cursor.execute(""" select * from actorinfo""")
result=cursor.fetchall()
result

[('PENELOPE', 'GUINESS'),
 ('NICK', 'WAHLBERG'),
 ('ED', 'CHASE'),
 ('JENNIFER', 'DAVIS'),
 ('JOHNNY', 'LOLLOBRIGIDA'),
 ('BETTE', 'NICHOLSON'),
 ('GRACE', 'MOSTEL'),
 ('MATTHEW', 'JOHANSSON'),
 ('JOE', 'SWANK'),
 ('CHRISTIAN', 'GABLE'),
 ('ZERO', 'CAGE'),
 ('KARL', 'BERRY'),
 ('UMA', 'WOOD'),
 ('VIVIEN', 'BERGEN'),
 ('CUBA', 'OLIVIER'),
 ('FRED', 'COSTNER'),
 ('HELEN', 'VOIGHT'),
 ('DAN', 'TORN'),
 ('BOB', 'FAWCETT'),
 ('LUCILLE', 'TRACY'),
 ('KIRSTEN', 'PALTROW'),
 ('ELVIS', 'MARX'),
 ('SANDRA', 'KILMER'),
 ('CAMERON', 'STREEP'),
 ('KEVIN', 'BLOOM'),
 ('RIP', 'CRAWFORD'),
 ('JULIA', 'MCQUEEN'),
 ('WOODY', 'HOFFMAN'),
 ('ALEC', 'WAYNE'),
 ('SANDRA', 'PECK'),
 ('SISSY', 'SOBIESKI'),
 ('TIM', 'HACKMAN'),
 ('MILLA', 'PECK'),
 ('AUDREY', 'OLIVIER'),
 ('JUDY', 'DEAN'),
 ('BURT', 'DUKAKIS'),
 ('VAL', 'BOLGER'),
 ('TOM', 'MCKELLEN'),
 ('GOLDIE', 'BRODY'),
 ('JOHNNY', 'CAGE'),
 ('JODIE', 'DEGENERES'),
 ('TOM', 'MIRANDA'),
 ('KIRK', 'JOVOVICH'),
 ('NICK', 'STALLONE'),
 ('REESE', 'KILMER'),
 ('PARKER', 'GOLDBERG'),
 ('JULIA', 'BARRYMORE'),
 ('FRANCES', 'DAY-LEWIS'),
 ('ANNE', 'CRONYN'),
 ('NATALIE', 'HOPKINS'),
 ('GARY', 'PHOENIX'),
 ('CARMEN', 'HUNT'),
 ('MENA', 'TEMPLE'),
 ('PENELOPE', 'PINKETT'),
 ('FAY', 'KILMER'),
 ('DAN', 'HARRIS'),
 ('JUDE', 'CRUISE'),
 ('CHRISTIAN', 'AKROYD'),
 ('DUSTIN', 'TAUTOU'),
 ('HENRY', 'BERRY'),
 ('CHRISTIAN', 'NEESON'),
 ('JAYNE', 'NEESON'),
 ('CAMERON', 'WRAY'),
 ('RAY', 'JOHANSSON'),
 ('ANGELA', 'HUDSON'),
 ('MARY', 'TANDY'),
 ('JESSICA', 'BAILEY'),
 ('RIP', 'WINSLET'),
 ('KENNETH', 'PALTROW'),
 ('MICHELLE', 'MCCONAUGHEY'),
 ('ADAM', 'GRANT'),
 ('SEAN', 'WILLIAMS'),
 ('GARY', 'PENN'),
 ('MILLA', 'KEITEL'),
 ('BURT', 'POSEY'),
 ('ANGELINA', 'ASTAIRE'),
 ('CARY', 'MCCONAUGHEY'),
 ('GROUCHO', 'SINATRA'),
 ('MAE', 'HOFFMAN'),
 ('RALPH', 'CRUZ'),
 ('SCARLETT', 'DAMON'),
 ('WOODY', 'JOLIE'),
 ('BEN', 'WILLIS'),
 ('JAMES', 'PITT'),
 ('MINNIE', 'ZELLWEGER'),
 ('GREG', 'CHAPLIN'),
 ('SPENCER', 'PECK'),
 ('KENNETH', 'PESCI'),
 ('CHARLIZE', 'DENCH'),
 ('SEAN', 'GUINESS'),
 ('CHRISTOPHER', 'BERRY'),
 ('KIRSTEN', 'AKROYD'),
 ('ELLEN', 'PRESLEY'),
 ('KENNETH', 'TORN'),
 ('DARYL', 'WAHLBERG'),
 ('GENE', 'WILLIS'),
 ('MEG', 'HAWKE'),
 ('CHRIS', 'BRIDGES'),
 ('JIM', 'MOSTEL'),
 ('SPENCER', 'DEPP'),
 ('SUSAN', 'DAVIS'),
 ('WALTER', 'TORN'),
 ('MATTHEW', 'LEIGH'),
 ('PENELOPE', 'CRONYN'),
 ('SIDNEY', 'CROWE'),
 ('GROUCHO', 'DUNST'),
 ('GINA', 'DEGENERES'),
 ('WARREN', 'NOLTE'),
 ('SYLVESTER', 'DERN'),
 ('SUSAN', 'DAVIS'),
 ('CAMERON', 'ZELLWEGER'),
 ('RUSSELL', 'BACALL'),
 ('MORGAN', 'HOPKINS'),
 ('MORGAN', 'MCDORMAND'),
 ('HARRISON', 'BALE'),
 ('DAN', 'STREEP'),
 ('RENEE', 'TRACY'),
 ('CUBA', 'ALLEN'),
 ('WARREN', 'JACKMAN'),
 ('PENELOPE', 'MONROE'),
 ('LIZA', 'BERGMAN'),
 ('SALMA', 'NOLTE'),
 ('JULIANNE', 'DENCH'),
 ('SCARLETT', 'BENING'),
 ('ALBERT', 'NOLTE'),
 ('FRANCES', 'TOMEI'),
 ('KEVIN', 'GARLAND'),
 ('CATE', 'MCQUEEN'),
 ('DARYL', 'CRAWFORD'),
 ('GRETA', 'KEITEL'),
 ('JANE', 'JACKMAN'),
 ('ADAM', 'HOPPER'),
 ('RICHARD', 'PENN'),
 ('GENE', 'HOPKINS'),
 ('RITA', 'REYNOLDS'),
 ('ED', 'MANSFIELD'),
 ('MORGAN', 'WILLIAMS'),
 ('LUCILLE', 'DEE'),
 ('EWAN', 'GOODING'),
 ('WHOOPI', 'HURT'),
 ('CATE', 'HARRIS'),
 ('JADA', 'RYDER'),
 ('RIVER', 'DEAN'),
 ('ANGELA', 'WITHERSPOON'),
 ('KIM', 'ALLEN'),
 ('ALBERT', 'JOHANSSON'),
 ('FAY', 'WINSLET'),
 ('EMILY', 'DEE'),
 ('RUSSELL', 'TEMPLE'),
 ('JAYNE', 'NOLTE'),
 ('GEOFFREY', 'HESTON'),
 ('BEN', 'HARRIS'),
 ('MINNIE', 'KILMER'),
 ('MERYL', 'GIBSON'),
 ('IAN', 'TANDY'),
 ('FAY', 'WOOD'),
 ('GRETA', 'MALDEN'),
 ('VIVIEN', 'BASINGER'),
 ('LAURA', 'BRODY'),
 ('CHRIS', 'DEPP'),
 ('HARVEY', 'HOPE'),
 ('OPRAH', 'KILMER'),
 ('CHRISTOPHER', 'WEST'),
 ('HUMPHREY', 'WILLIS'),
 ('AL', 'GARLAND'),
 ('NICK', 'DEGENERES'),
 ('LAURENCE', 'BULLOCK'),
 ('WILL', 'WILSON'),
 ('KENNETH', 'HOFFMAN'),
 ('MENA', 'HOPPER'),
 ('OLYMPIA', 'PFEIFFER'),
 ('GROUCHO', 'WILLIAMS'),
 ('ALAN', 'DREYFUSS'),
 ('MICHAEL', 'BENING'),
 ('WILLIAM', 'HACKMAN'),
 ('JON', 'CHASE'),
 ('GENE', 'MCKELLEN'),
 ('LISA', 'MONROE'),
 ('ED', 'GUINESS'),
 ('JEFF', 'SILVERSTONE'),
 ('MATTHEW', 'CARREY'),
 ('DEBBIE', 'AKROYD'),
 ('RUSSELL', 'CLOSE'),
 ('HUMPHREY', 'GARLAND'),
 ('MICHAEL', 'BOLGER'),
 ('JULIA', 'ZELLWEGER'),
 ('RENEE', 'BALL'),
 ('ROCK', 'DUKAKIS'),
 ('CUBA', 'BIRCH'),
 ('AUDREY', 'BAILEY'),
 ('GREGORY', 'GOODING'),
 ('JOHN', 'SUVARI'),
 ('BURT', 'TEMPLE'),
 ('MERYL', 'ALLEN'),
 ('JAYNE', 'SILVERSTONE'),
 ('BELA', 'WALKEN'),
 ('REESE', 'WEST'),
 ('MARY', 'KEITEL'),
 ('JULIA', 'FAWCETT'),
 ('THORA', 'TEMPLE')]

In [10]:
result = pd.read_sql("""select * from actorinfo""",conn)
result.head(5)

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

### Exercise 2:how to replace a view

In [14]:
cursor.execute(""" create or replace view actorinfo
                    (f_name,l_name)
                    as select first_name,last_name
                    from actor; """)

In [17]:
result = pd.read_sql(""" select * from actorinfo """,conn)
result.head(3)

     f_name    l_name
0  PENELOPE   GUINESS
1      NICK  WAHLBERG
2        ED     CHASE

### Exercise 3:how to delete a view

In [19]:
cursor.execute(""" drop view actorinfo""")

In [20]:
cursor.close()

True